package sensitive.filter;

import org.junit.Assert;
import org.junit.jupiter.api.Test;

import java.util.Arrays;

class SensitiveWordFiltersTest {

	@Test
	void refactoringBy() {
		SensitiveWordFilters.refactoringBy(Arrays.asList(getSensitiveWords()));
	}

	@Test
	void add() {
		SensitiveWordFilters.add(Arrays.asList("敏感词"));
	}

	@Test
	void foundIn() {
		SensitiveWordFilters.refactoringBy(Arrays.asList(getSensitiveWords()));
		Assert.assertTrue(SensitiveWordFilters.foundIn("白银混蛋"));
	}

	@Test
	void findOutFrom() {
		SensitiveWordFilters.refactoringBy(Arrays.asList(getSensitiveWords()));
		System.out.println(SensitiveWordFilters.findOutFrom("白银混蛋"));
	}

	@Test
	void replace() {
		SensitiveWordFilters.refactoringBy(Arrays.asList(getSensitiveWords()));
		String string = "就算是一个 顶-级 高 手，也会被那个白银 混蛋坑得很惨";
		System.out.println(SensitiveWordFilters.replace(string, "*"));
	}

	private static String[] getSensitiveWords() {
		return sensitiveWords.split("\\|");
	}

	static final String sensitiveWords = "顶级|女優|小泽玛莉亚|强歼|乱交|色友|婊子|蒲团|女女|喷尿|绝版|三級|武腾兰|暴干|阴唇|小泽圆|插插|長瀨愛|川島和津實|小澤園|飯島愛|星崎未來|及川奈央|朝河蘭|夕樹舞子|" +
			"大澤惠|金澤文子|三浦愛佳|伊東|武藤蘭|无毛|猛插|A片|A级|喷精|小穴|被虐|被迫|强暴|破处|精液|幼交|狂干|兽交|群交|露点|露毛|武藤兰|饭岛爱|波霸|叫床|亚热|援交|肉欲|18禁|潮吹|肛交|群射|内射|臭作|薄格|調教|" +
			"連發|一本道|櫻井|風花|夜勤病栋|菱恝|虐待|激情|麻衣|三级|吐血|行房|自慰|吹萧|色狼|内裤|底裤|私处|爽死|变态|妹疼|妹痛|弟痛|姐痛|哥疼|哥痛|打炮|造爱|作爱|做爱|鸡巴|阴茎|阳具|开苞|肛门|阴道|阴蒂|肉棍|" +
			"肉棒|肉洞|荡妇|阴囊|睾丸|插我|插你|插她|插他|干她|射精|口交|屁眼|阴户|阴门|下体|龟头|阴毛|避孕套|大鸡巴|高潮|真善忍|明慧|洪志|红志|洪智|红智|法轮|法论|法沦|法伦|发轮|发论|发沦|发伦|轮功|轮公|轮攻|沦功|" +
			"沦公|沦攻|论攻|论功|论公|伦攻|伦功|伦公|六四|台独|柴玲|李鹏|江泽民|朱容基|朱镕基|李长春|李瑞环|胡锦涛|魏京生|台湾独立|藏独|西藏独立|疆独|新疆独立|邓小平|大盖帽|夜总会|坐台|李远哲|尉健行|李岚清|黄丽满|" +
			"于幼军|文字狱|自焚|吸储|张五常|张丕林|温家宝|吴邦国|曾庆红|吴官正|贾庆林|大紀元|紅志|紅智|法輪|法論|法淪|法倫|發輪|發論|發淪|發倫|輪功|輪公|輪攻|淪功|淪公|淪攻|論攻|論功|論公|倫攻|倫功|倫公|民運|台獨|" +
			"李鵬|江澤民|朱鎔基|地下教会|胡锦涛|干你娘|日死你|我操你|干死你|政治犯|热比娅|太子党|悔过书|暴乱|北美自由论坛|持不同政见|鸡八|操你|婊子|我操|日你|操他|操蛋|贱人|狗娘|打炮|贱逼|贱比|龟公|屁眼|奸淫|淫荡|" +
			"牛比|杂种|性交|肛交|自焚|学潮|抡功|轮奸|毛片|卖逼|妈批|共匪|共狗|国贼|逼样|暴政|藏独|独裁|达赖|白银混蛋|草你吗|操你妈|草你妈|你妈逼|你吗比|你个煞笔|傻逼|法轮功|法轮大法|转法轮|台湾独立|他妈的|傻B|狗b|" +
			"二B|B样|鸡巴|操逼|操比|江贼|僵贼|疆独|射精|统战|天怒|统独|返佣|假证|一夜情|裸聊|浪穴|美穴|AV女|赤裸|波霸|无码|艳照|鑫祥安|亡國|自棼|平反|共黨|刻章|民运|A片|无网界|买春|迷药|迷奸|销魂|熟女|法轮|煞笔|傻比|" +
			"习近平|做爱|作爱|乱伦|催情|江澤民|台湾建国运动组织|反社会|罗干|台湾青年独立联盟|严家其|朱毛|方励之|江贼民|罗礼诗|台湾政论区|严家祺|朱容基|白立朴|江折民|马大维|台湾自由联盟|阎明复|朱溶剂|飞扬论坛|江猪|" +
			"马良骏|颜射|朱镕基|斐得勒|江猪媳|马三家|汤光中|猪聋畸|费良勇|江主席|马时敏|唐柏桥|杨怀安|鲍戈|分家在|姜春云|鲍彤|将则民|毛厕洞|滕文生|粉饰太平|天安门录影带|杨月清|僵贼民|毛贼东|天安门事件|北大三角地论坛|" +
			"风雨神州论坛|美国参考|天安门屠杀|姚月谦|北韩|封从德|天安门一代|夜话紫禁城|酱猪媳|蒙独|一中一台|蒙古独立|义解|冯素英|密穴|童屹|自由民主论坛|博讯|佛展千手法|绵恒|异见人士|蔡崇国|付申奇|揭批书|统独论坛|曹长青|" +
			"傅志寰|易志熹|曹刚川|淫穴|高文谦|民意论坛|外交与方略|尹庆民|开放杂志|万润南|由喜贵|陈炳基|民阵|万维读者论坛|高自联|民猪|幼齿|戈扬|邝锦文|汪岷|陈破空|鸽派|民主墙|陈希同|老江|莫伟强|舆论|陈一谘|工自联|木犀地|" +
			"舆论反制|陈总统|功法|老人政治|木子论坛|宇明网|黎安友|南大自由论坛|程铁军|王涵万|远志明|李大师|倪育贤|王沪宁|岳武|迟浩田|李登辉|你说我说论坛|王军涛|共军|则民|赤匪|关卓中|李宏志|王瑞林|择民|赤化|贯通两极法|" +
			"李洪宽|贼民|王冶坪|张伯笠|郭岩华|李录|钱其琛|抢粮记|尉健行|张宏堡|魏京生|fa轮|亲美|魏新生|李少民|温家宝|大中国论坛|汉奸|青天白日旗|大中华论坛|何德普|吴百益|李小鹏|吴邦国|河殇|李月月鸟|吴方城|赵品潞|李志绥|" +
			"吴官正|赵晓微|红色恐怖|李总理|吴弘达|赵紫阳|邓笑贫|宏法|李总统|热站政论网|吴宏达|哲民|迪里夏提|洪传|连胜德|吴仁华|真善忍|洪吟|联总|人民内情真相|吴学灿|地下刊物|洪哲胜|廉政大论坛|吴学璨|炼功|人民之声论坛|" +
			"吾尔开希|胡紧掏|梁光烈|争鸣论坛|电视流氓|梁擎墩|伍凡|正见网|胡锦滔|日内瓦金融|正义党论坛|丁关根|胡锦淘|两岸三地论坛|瑞士金融大学|西藏独立|胡景涛|洗脑|丁子霖|善恶有报|东北独立|胡总书记|项怀诚|政治反对派|" +
			"东方红时空|项小吉|廖锡龙|邵家健|支那|东南西北论谈|指点江山论坛|东社|华通时事论坛|林长盛|神通加持法|东土耳其斯坦|林樵清|中功|东西南北论坛|华语世界论坛|林慎立|升天|谢选骏|华岳时事论坛|盛华仁|谢中之|中国复兴论坛|" +
			"黄慈萍|刘宾深|辛灏年|独裁政治|黄祸|刘宾雁|独夫|石戈|新华举报|独立台湾会|刘国凯|新华内情|中国社会进步党|杜智富|刘华清|多维|回民暴动|新疆独立|中国威胁论|屙民|刘凯中|中国问题论坛|俄国|鸡毛信文汇|刘千石|新闻封锁|" +
			"中国真实内容|发愣|姬胜德|新语丝|发轮|积克馆|刘山青|发正念|刘士贤|司马晋|邢铮|法愣|贾庆林|刘文胜|司马璐|中华大众|法抡|贾廷安|司徒华|熊焱|中华讲清|法仑|贾育台|法伦|建国党|刘永川|四川独立|徐邦秦|中华人民实话实说|" +
			"徐才厚|中华人民正邪|法论|江八点|中华时事|法十轮十功|江流氓|龙虎豹|宋书元|徐水良|中华养生益智功|许家屯|中华真实报道|法lun功|法谪|江绵恒|吕京花|苏绍智|钟山风雨论坛|法谪功|苏晓康|反封锁技术|江戏子|台独|周锋锁|" +
			"反腐败论坛|江则民|伦功|台盟|周天法|江泽慧|轮大|江泽民|轮功|台湾狗|学自联|朱嘉明|李洪志|小鸡鸡|发论公|强奸|发论功|狗卵子|法功|群奸|狗操|猪操|法抡功|发骚|推翻|骚货|打倒|反封锁|睾丸|烂逼|烂比|龟头|狗屎|奶子|妓女|" +
			"回民暴|招妓|十八摸|阴道|阴水|阴唇|阴蒂|喷你|狂操|发伦功|大花逼|发伦|他母亲|哈批|大逼|大比|蒙古独|发抡功|插你|四川独|发抡|台湾独|精液|你妈的|氵去|去你妈的|车仑|工力|阝月|烂货|失密|出卖|贱货|屄|肛门|阴茎|曹培炎|" +
			"草榴|插插|插过肛门|插她|插他|插我|插穴|长舌象|長瀨愛|長瀬愛|超级性虐|超爽|朝河蘭|潮吹|陈良宇|陈水扁|撑粤语|成人电影|成人论坛|成人漫画|成人书库|成人图|成人图片|成人网|成人网站|成人文学|成人小说|成人影视|臭作|" +
			"出售假钞|出售枪支|出售手枪|处女|处女膜|处女终结者|川島和津實|床上功夫|吹萧|粗口歌|打手枪|大乏|大伐|大罚|大阀|大筏|大法大福|大法弟子|大法洪传|大法轮|大珐|大盖帽|大蓋帽|大鸡巴|大紀元|大久保玲|大澤惠|党出贪官咱行贿|" +
			"党出小姐咱陪睡|党禁|党内分裂|党治不了的.非典都能治|荡妇|邓派|鄧小平|地下钱庄|东京热|多党|多黨|发仑|发囵|发沦|发纶|发轮工|发轮弓|发轮公|发轮功|发轮攻|发轮供|发轮肱|发轮宫|发轮恭|发轮蚣|发轮躬|发轮龚|发轮觥|发轮巩|" +
			"发轮汞|发轮拱|发轮珙|发轮共|发轮贡|发轮红|发情|發倫|發淪|發輪|發論|乏抡|乏仑|乏伦|乏囵|乏沦|乏纶|乏论|伐抡|伐仑|伐伦|伐囵|伐沦|伐纶|伐轮|伐论|垡抡|垡仑|垡伦|垡囵|垡沦|垡纶|垡论|罚抡|罚仑|罚伦|罚囵|罚沦|罚纶|罚轮|" +
			"罚论|阀抡|阀仑|阀伦|阀囵|阀沦|阀纶|阀论|筏抡|筏仑|筏伦|筏囵|筏沦|筏纶|筏论|法轮|法仑功|法囵|法囵功|法沦|法沦功|法纶|法纶功|法轮佛法|法轮工|法轮弓|法轮公|法轮攻|法轮供|法轮肱|法轮宫|法轮恭|法轮蚣|法轮躬|法轮龚|法轮觥|" +
			"法轮巩|法轮汞|法轮拱|法轮珙|法轮共|法轮贡|法轮红|法倫|法淪|法輪|法论功|法論|法网恢恢|法正乾坤|法正人间|砝抡|砝仑|砝伦|砝囵|砝沦|砝纶|砝论|珐抡|珐仑|珐伦|珐囵|珐沦|珐纶|珐论|反党|反国家|反华|反雷达测速|反贪方知无官正|" +
			"反政府|犯浪|饭岛爱|飯島愛|仿真假钞|放贷款|放下生死|放账|肥穴|粉嫩的小沟|风骚|腐敗|干柴烈火|干她|感情陪护|赣江学院暴动|岡崎|高幹|高利息贷款|高息贷款|哥疼|哥痛|鬲洪志|各种机打|各种姿势任意插|攻关小姐|宮下杏奈|巩利没带套|" +
			"共产极权|共产王朝|共产无赖|共产专制|共铲党|共奴|勾引|滚珠棒|海外护法|和平修炼|河源义乌|黑社会|黑社會|红音|红志|红智|洪发交流|紅志|紅智|后露大阴道|后庭|胡錦濤|胡温政府|花都芙蓉|换妻|黃菊|黃麗滿|黄丽满|黄片|黄色电影|" +
			"黄色漫画|黄色图片|黄色网站|黄色文学|黄色小说|黄色影视|回良玉|会叫床|活体器官|机巴|鸡鸡|鸡奸|及川奈央|吉岡美穗|几巴|加藤|賈慶林|假钞|假发票|奸|姦|监听宝|监听器|监听王|菅野亚梨沙|江湖淫娘|江理论|江罗集团|江念:哥哥.下面痒死了!|" +
			"江泽民扶你下飞机|疆獨|交媾|脚交|叫床|姐疼|姐痛|金瓶梅|金鱼缸|金澤文子|锦滔|锦韬|锦洮|锦陶|警察殴打|九评共产党|菊花蕾|绝食抗暴|开苞|空难|空難|口爆|酷刑|狂干|捆绑|岚綮|岚亲|岚青|岚氢|岚轻|岚倾|岚卿|岚清|岚蜻|岚鲭|" +
			"岚情|岚氰|岚擎|岚苘|岚请|岚庆|岚箐|岚磬|澜青|篮清|览青|揽青|缆青|缆清|浪货|浪叫|老二|厘洪志|梨洪志|狸洪志|离洪志|莉洪志|骊洪志|犁洪志|喱洪志|鹂洪志|漓洪志|缡洪志|蓠洪志|蜊洪志|嫠洪志|璃洪志|鲡洪志|黎洪志|篱洪志|" +
			"罹洪志|藜洪志|蠡洪志|礼洪志|李長春|李轰志|李哄志|李訇志|李烘志|李薨志|李弘志|李红志|李宏执|李宏趾|李闳志|李泓志|李洪抵|李洪识|李洪氏|李洪之|李洪支|李洪卮|李洪汁|李洪芝|李洪吱|李洪枝|李洪知|李洪织|李洪肢|李洪栀|" +
			"李洪祗|李洪胝|李洪脂|李洪蜘|李洪侄|李洪直|李洪值|李洪埴|李洪职|李洪植|李洪殖|李洪絷|李洪摭|李洪踯|李洪止|李洪只|李洪旨|李洪址|李洪纸|李洪芷|李洪祉|李洪咫|李洪指|李洪枳|李洪轵|李洪黹|李洪至|李洪忮|李洪豸|李洪制|李洪帙" +
			"|李洪帜|李洪治|李洪炙|李洪质|李洪郅|李洪峙|李洪栉|李洪陟|李洪挚|李洪桎|李洪秩|李洪致|李洪贽|李洪轾|李洪掷|李洪痔|李洪窒|李洪鸷|李洪彘|李洪智|李洪滞|李洪痣|李洪蛭|李洪骘|李洪稚|李洪置|李洪雉|李洪膣|李洪觯|李荭志|李虹志|" +
			"李鸿志|李蕻志|李黉志|李讧志|李嵐清|李鵬|李瑞環|李远哲|李遠哲|里洪志|里鹏|俚洪志|哩洪志|哩鹏|娌洪志|逦洪志|理洪志|理鹏|锂洪志|鲤洪志|澧洪志|醴洪志|鳢洪志|力洪志|力鹏|历洪志|厉洪志|立洪志|吏洪志|丽洪志|利洪志|励洪志|" +
			"呖洪志|坜洪志|沥洪志|苈洪志|例洪志|例鹏|戾洪志|枥洪志|疠洪志|隶洪志|俐洪志|俪洪志|疬洪志|荔洪志|轹洪志|郦洪志|栗洪志|猁洪志|砺洪志|砾洪志|莅洪志|唳洪志|笠洪志|粒洪志|粝洪志|蛎洪志|傈洪志|痢洪志|詈洪志|跞洪志|雳洪志|" +
			"溧洪志|篥洪志|联邦政府|两性狂情|凌辱|铃木麻奈美|刘淇|刘云山|流氓民运|流氓无产者|流氓政府|六四事件|露点|露毛|露乳房|乱交|伦公|伦攻|伦理|沦公|沦功|沦攻|轮公|轮攻|倫公|倫功|倫攻|淪公|淪功|淪攻|輪公|輪功|輪攻|论攻|論公|" +
			"論功|論攻|羅幹|裸干|裸体|妈个|媽個|麻衣|卖春|卖淫嫖娼|猫肉|貓肉|毛派|妹疼|妹痛|猛插|迷奸药|蜜穴|民運|民脂民膏胡紧掏|明慧网|明慧周刊|摸奶|内斗退党|内射|男女公关|男女攻关|嫩穴|你B里|你逼|你的B|你的逼|你的小洞|你的穴|" +
			"尿尿|女優|虐待|炮图|喷精|喷尿|喷射|彭德怀|蓬门|骗局|騙局|嫖|嫖娼|迫-害|破处|蒲团|器官移植|強暴|强暴|强歼|窃听器|亲共行动|青木友梨|全国退党|全新假钞|群交|群射|人民尚未温加饱|日野美沙|戎基|肜基|狨基|绒基|茸基|荣基|" +
			"容基|嵘基|溶基|蓉基|榕基|熔基|蝾基|镕基|融基|冗基|揉你的乳房|肉棒|肉洞|肉棍|肉欲|乳交|乳头|瑞欢|瑞还|瑞洹|瑞桓|瑞锾|瑞寰|瑞缳|瑞缓|瑞幻|瑞奂|瑞宦|瑞唤|瑞换|瑞浣|瑞涣|瑞患|瑞鲩|三个代表无帮国|三個代表|三陪|三陪先生|" +
			"三陪小姐|三浦愛佳|骚逼|骚姐荡妹|骚穴|色狼|色情网站|色友|色诱|色欲|沙雪|少女高潮|身边有参谋朱容基|深田涼子|榊彩弥|师傅法身|手机跟踪定位器|手机卡复制器|首長|兽交|兽欲|售弹药|售卖武器|售枪支|書記|双腿间的禁地|爽死|" +
			"司法警官|私处|酥乳|酥胸|台獨|台速集团|臺灣獨立|探测狗|唐家璇|桃井望|桃源洞|特码|特务民运|藤井彩|天安门前烧自己|天安門|舔奶|舔穴|跳蛋|捅你|捅我|偷情|兔女郎|王乐泉|王兆国|网络色情网址大全|维权抗暴|慰安妇|溫家寶|文字狱|" +
			"文字獄|翁虹|我后台党中央|我想你想得下面胡启立|无线市话|吳邦國|無修正|五套功法|武腾兰|武藤蘭|夕樹舞子|西藏獨立|西藏人权|吸储|吸儲|吸鸟|销售枪支|小弟弟|小姐搞三讲|小森美王|小穴|小泽玛莉亚|小泽圆|小澤園|新加坡佳乐集团|" +
			"新疆獨立|星崎未来|星崎未來|星野桃|刑警|性爱|性爱图|性高潮|性交易|性免费电影|性虐待|性派对|修炼之歌|穴穴|艳照门|阳具|阳萎|杨阑月经到|杨澜月经到|痒穴|夜激情|夜勤病栋|夜夜笙歌里藏春|夜夜笙歌里常春|夜總會|一本道|一党专制|" +
			"一黨|伊東|以屁股为动力|阴部|阴帝|阴户|阴精|阴毛|阴门|阴囊|陰|淫姐姐|淫女|淫水|淫图|淫汁|隐形喷剂|应招妓女|应召女郎|桜井|桜田|鹰派|櫻井|右派|幼交|诱奸|于幼军|於幼軍|俞正声|宇宙最高法理|玉蒲团|圆明网|援交|造爱|泽茗|" +
			"泽冥|泽铭|泽溟|泽暝|泽瞑|泽螟|泽酩|泽命|责民|啧民|仄民|曾慶紅|曾曾贾贾九常委|咋民|张德江|张丕林|张五常|張丕林|張五常|针对台湾|针孔摄像|真空秀|真木加美|姫島瑠璃香|正法时期|正派民运|政府软弱|政府无能|支联会|中共暴政|" +
			"中共独枭|中共恶霸|中共监狱|中共警察|中共迫害|中共小丑|中共政权|中共专制|中共走狗|中华联邦政府|中条美華|中央军委|中野千夏|周恩来|周永康|朱鎔基|主席嫖娼|专政|专政机器|專政|專制|转发轮|转发论|转伐轮|转筏论|转法论|转珐轮|" +
			"自摸|自慰|自由联邦|自由亚洲|坐交|坐台|日他|日货|票据|妈比|李洪峰|巨波|贾安|恶劣|大纪|博彩|周济|中朝|正西液压|真善美|张庆伟|张海阳|张国清|张宝顺|泽东|玉树|印章|叶剑英|艳影|玄机|星相|信用合作社|信访局|新势力|谢小庆|" +
			"谢和平|肖捷|吴镇南|吴胜利|伟哥|王学军|王八蛋|彤体|汤涛|苏家屯|四联航空|沈浩波|汕尾|骚|惹火|去死|去你妈|企信专家|泡妞|两性|口蹄疫|开房|巨乳|鸠|江八|鸡巴|旦科|春药|藏娇|阿拉伯之春|孟母来文|紫竹半岛|紫竹|亡国亡党|五套法|" +
			"刑讯逼供|艳情小说|摇头丸|中国高层权力斗争|中南海斗争|中南海高层权力斗争|中南海秘闻|中央警卫局大换血|自制固体火箭|总书记的红人|痴母|代考上网文凭|赌博透视器|珐论大珐|风流|共产党说反腐|滚蛋|甲基苯丙胺|恐怖分子|雷管制造|" +
			"两会十大废话议案|猎头者|六四天网|麻黄素|麻醉钢枪|麻醉乙醚|迷药防身药水|绵恒异议人士|男男激情|做爱挑逗|17大人事预测|ㄐ掰|疯狂掠夺大陆股民|告中国人民解放军广大官兵书|国家主要部委|权威主义国家的合法性理论|塞你母|十七庆红|" +
			"娇嫩欲滴|小肛|包娼包赌|被阿扁推翻了|私彩|屏蔽器|抢劫药|日本的言论|十大无耻发言|手榴弹|税嘌|台湾联盟|一贯道|正帮通信公司|中共领导人黑幕|你妈铋|性伴侣|复仇|九—评|推翻共产党|完全自杀手册|小口径步枪|性交大赛|阴道|淫浪|" +
			"制作原子弹的方法|中南海大决战|中南海权力斗争|自制手枪|爆乳|反腐败|反民主|高校暴乱|工字牌气枪|核弹制作方法|弘法会|论公|麻古制作工艺|迷情粉|免费艳情淫秽小说淫秽bt电影淫秽图片|民运分子|第五代领导新星|二乙基酰胺|分头黑箱作业|" +
			"干妳老母|膏药旗|龟儿子|黑手党|藏青会|拉姆斯菲尔德|吗啡片|麦角酸|民主潮|日他娘|十七大人事调整|水去车仑|外汇局|网赚队伍|爆炸物|提供特码|綦彦臣|曲马多|入联公投|三唑|三唑仑|色情服务|沙菲片|十大丑陋语录|双管猎枪|金操盘|" +
			"畅联卡|冰毒|独栋|扎卡维|中共十七大前夕人事布局出手既稳又重|中共政治新星|中国报禁怎样开|中国政治新星|鸠屎|乏轮|珐轮|弘志|垡轮|闳志|泓志|报禁|色情女人|太子党名单|突厥革命|硝酸甘油炸药制造|邪党|血腥图片|盐酸去氧麻黄碱|" +
			"炸弹物|成人片|出售K粉|导弹DIY|丁丙诺啡|毒残酷迫|赌博作弊工具|分裂中华人民共和国|古方迷香|古装情欲力作|激流中国|集资骗局|简易炸蛋制作方法|论功|麻古|麻醉药|蒙汗药|蒙汗药粉|迷魂药|传中共中央关于17大的人事安排意见|党风日下|" +
			"干妳妈|gay|藏独|坐台小姐|卖淫|塞你爸|塞你老母|十七大人事安排意见|十七大未来|十七换血|摊牌要权|葳独|VOA采访热比娅|透码|爆炸|成人生活片|代开票|东突厥斯坦|台湾团结联盟|宫廷舞蹈|易达网络卡|曾庆红削权|政局雾里看花|中共十七热门人选|" +
			"总书记红人|发瞟|虹志|荭志|砝轮|性爱狂人|辛子陵|推翻社会主义制度|西藏暴动|西藏流亡政府|香港赛马会|遥控炸弹|炸药配方|摘取器官|中国断交|中国国家防火墙|成熟社区|中央派系斗争|中央团系|绳虐|PK黑社会|我日你娘|大麻|法一轮|官商暴利|" +
			"官商勾结|海洛因|黄色妹妹a级大片|活人器官|恐怖袭击|唠嗑药|老虎机|麻古制作方法|麻古制作技术|迷幻|拍肩神药|17高官互调|党校安插亲信|第5代领导|恩格斯|干妳娘|干你妈逼|公开信胡书记|成人用品|烂屌|人弹|生鸦片|十七大预测|十七大政治局|" +
			"微型无线隐型耳机|A级片毛片下载男男影院|CT透视器银行卡复制器|冰毒|迷幻药|狗日|横死|核污染|强力弩枪|情色社区|日好色女成人网bt色情电影色情小电影|骚货|色情小电影|台湾共合国|铁友|钜献|cbd|公禺|開盘|优化官员|中共反腐风暴大背景揭秘|" +
			"色情场所|王子淫传|我们自杀吧|香港赛马会六合网|银行卡复制器|罂粟籽|原子弹|炸弹遥控器|政府说为人民服务|中南海波澜起伏|中南海内斗|中央军委扩大会议|电子解码器|东突厥斯坦伊斯兰运动|发漂|干你|高低压三箭|高压麻醉枪|古方化骨水|" +
			"國際公法|核武器制作方法|洪法交流|环三亚甲基三硝氨|活体器官移植|基地组织|激情下载|激情小电影|氯胺酮|麻药|麻醉枪|迷魂|免费淫奸黄色电影|男女激情片下载|屌妳|屌鸠|ムㄞ你母|大血B|当官靠后台|共青团背景|龟孙子|国际法院|红潮谎言录|" +
			"妈卖妈屁|摩门教|瘸腿帮|人事布局出手既稳又重|人体炸弹|撒尿|萨拉托加|卖国唐捷|冰毒制作方法|枪枝|六四民主运动|性服务|艾滋|佛挡杀佛|枪支弹药|三浦爱佳|世纪血腥|赌场|典藏大宅|鹰狼传|政坛明日之星|政治局十七|中共权斗|中共十七大的基层选举|" +
			"中共十七大前夕|中共政坛腐败内幕|中南海高层权利斗争|K你妈|投毒杀人|香港六合彩总公司|邪恶中共|异丙嗪|中共激烈内斗|中南海浓云密布|中央政治局推荐人选|自制固体火箭全过程|淫秽|成人社区|出售迷魂药|大规模反中游行|二乙酰吗啡|反动|" +
			"刚珠枪|钢珠枪|黑索今|昏药|甲基安非他明|监视器偷拍|雷管|麻醉抢|屄命|换届隐忧|AV片|藏旗|可待因|恐怖份子|吗啡碱|日你妈啦逼|驶你老母|暴干|暴虐乱伦|暴政独裁|投毒|成人频道|操你妈逼|强效失意药|情色大片|情色电影|三码|商网营销|白粉|" +
			"叫鸡|毒品|玛卡|恐怖|香港强效迷幻GHB水|鸦片|盐酸羟亚胺|艳舞女郎|蚁力神非法集资案|阴道被捅|炸药的合成|针孔摄像头|执法犯法|制造炸弹|中共独裁|中共解体|中共近期权力斗争|中共权力斗争|中共十七布局|中共统治|中国储君|中国高层人事变动解读|" +
			"中国国际战略研究网|中国太子|请需要接种肺|中南海的权力游戏|中南海惊现东宫小朝廷|最强领导人|群P|痴女|禁片|达赖喇嘛|颠覆国家政权|毒品配方|反攻大陆|泛绿|分裂中国|干你妈|狗日的|挤踏身亡|戒严|看片区|灵修团体|龙虎豹宋书元|麻醉手枪|" +
			"迷昏香烟|迷昏药|迷香|弩枪|17大的人事安排意见|17大委员名单|K粉|澤民|ムㄞ你娘|操我|大麻树脂|第五代领导人|反恐委员会|中共派系力量再达成妥协|高莺莺|加拿大皇家骑警|强奸犯|日本狗|如何推翻中共|驶你母|世华商务|檀鑫|封杀酱猪媳|冰毒片|" +
			"冰毒制作技术|淫乱|炸药|追讨债务|追债|强奸药|师涛|我妳老爸|耶和华|游龙商务联盟|中共权利斗争|中共十七大热门人选|運動|筏轮|代开建筑发票|代开安装发票|假文凭|皮肉生意|土匪政府|文革杀资产阶级|五连猎枪|香港赛马会大型六合彩资讯网|" +
			"性交姿势|盐酸氯胺酮|乙醚|淫欲|优惠代理全国各大城市发票|中共心中最大的恐惧|中国三大流氓职业|中央十七|操他妈|出售假币|催情药|大陆同修|大祚荣|疯药|钢珠手枪|高息借款|各类枪枝及防身器|核销单|佳静安定片|可卡因|老婊子|雷管制造技术|" +
			"六合采|吗啡|买卖枪支|卖炸药|迷情|灭亡中国|虐杀|妳老母的|妳娘的|屌七|笨逼|操妳|吹箫|从陈良宇倒台看中国政局走势|弟大物勃|干你妈|告全国股民同胞书|官场日志|爆浆|吹气娃娃|菜市口交|可卡叶|人民大会堂|傻屄|十七大权力变更|她马的|舔西|" +
			"暴动|被虐|冰毒配方讲解光盘|贞操|东突厥斯坦伊斯兰|权柄|代人报仇|屁精|同性恋|扎针|被艾滋|枪械|去氧麻黄碱|全套艳照门|燃烧弹|深圳红印户口咨询|手表式作弊器|手雷|真理教|致幻剂|中共伪政权|中国媒体十大事件|中央召开北戴河会议决定十七大高层人事|" +
			"艾未未|捍卫领土|捍卫主权|釣魚島|末日|E口令|襙你吗的|南溪花园|砸金蛋|太子娱乐城|穷比|有病啊|打倒共产党|淫叫|真人娱乐|真人百家乐|極性女皇|我擦|债务外包|灭绝人性|过夜费|股票私募|香港民主|香港占中|場外双重|窃据|新华联慧谷|任人唯亲|" +
			"黨|車仑|青云镇|了仇|中栱|冤案|发漂|香港金利集团|枪支|激晴|超模裸泳|丝袜撕奸|终共本是恶魔变|激晴T台|吞惊口暴|日式姓爱|深喉口鲍|鲸吞口鲍|姓爱大师|群模浪舞|水晶舞台房|口暴|涉黄|代開各類發票|政府利用青奥敛财|江派三英宋祖英秘密被捕|" +
			"反日份子|鲁甸地震预兆|反共游行|邪恶本质|揭露中共邪恶本质|薄熙来|天安门广场自焚|中国共产党亡|青奥会反日游行|三退保平安|博彩|和异性开房被抓|维吾尔自由运动|印尼伊斯兰祈祷团|突厥斯坦|宗教迫害|全能神教|三退|退出中共无神论|" +
			"魔党|颜色革命|反日|邪教|灭共匪|行业垃圾短信关键词测试|产党|k隆|河南SASS系统|盛大开盘|百亿商圈|院宅|fa票|养卡|骚扰|网投麻将|男女性病|盘锌|骰宝|处子|龙光城|尚峰|沖高|基药|尚河富都|有铲权|主神教|钰鑫|有事烧纸|新约教会|" +
			"无奶咖绿|徒弟会|同一教|三班仆人派|全家死光|灵灵教|德佑|达米宣教会|ZF非法|钱坤小李|性欲|杀梅花鹿|脑得生浓缩丸|沐坤教育|秘书护士野战|俄罗斯妹妹激情表演|担保灵活|成武中慧|白痴|几吧|贱|教养院|六码|你大爷|融达汇|他妈|我草|做鸭|淫|折寿|人渣";

}